In [6]:
import pandas as pd

## Creating DataFrame from Dict

In [7]:
df = pd.DataFrame({"Grades":[85,72,92,100,88],
            "Students":["Matt", "Tom", "Jerry", "Lucy", "Shannon"],
                 "ClassPeriod":[1,1,2,2,2]})

df

   Grades Students  ClassPeriod
0      85     Matt            1
1      72      Tom            1
2      92    Jerry            2
3     100     Lucy            2
4      88  Shannon            2

## Filtering Datasets

In [8]:
#basic index-boolean filter

filtered_df = df[df["Grades"] > 85]

filtered_df

   Grades Students  ClassPeriod
2      92    Jerry            2
3     100     Lucy            2
4      88  Shannon            2

### This index filter is actually doing this...

In [9]:
#first creates a helper column

df["helper"] = df['Grades'].apply(lambda x: x > 85)
df

   Grades Students  ClassPeriod  helper
0      85     Matt            1   False
1      72      Tom            1   False
2      92    Jerry            2    True
3     100     Lucy            2    True
4      88  Shannon            2    True

In [13]:
#next filters for True in helper column, drops helper
df = df[df.helper == True]
df.drop(columns=['helper'], inplace=True)
df

   Grades Students  ClassPeriod
2      92    Jerry            2
3     100     Lucy            2
4      88  Shannon            2